

* lockerr
** dealer_admin
*** DONE issue71 Не убираются клиенты из "Новых"
    CLOCK: [2014-02-10 Пн 21:48]--[2014-02-10 Пн 22:11] =>  0:23
    CLOCK: [2014-02-10 Пн 20:29]--[2014-02-10 Пн 21:22] =>  0:53
*** TODO issue62 Сортировка и пагинация клиентов
**** TODO Поправить просроченных с активными дуингами
     CLOCK: [2014-03-05 Ср 21:56]--[2014-03-05 Ср 22:15] =>  0:19
     CLOCK: [2014-03-05 Ср 20:59]--[2014-03-05 Ср 21:42] =>  0:43
     - Note taken on [2014-03-04 Вт 23:30] \\
       В "Просроченных" есть клиенты, у которых назначены
       следующие действия - это неверно, они должны быть или "В
       работе", или на соответствующих вкладках.
**** TODO
     - Note taken on [2014-03-04 Вт 23:49] \\
       В "просроченных" есть клиенты, которые на самом деле
       "отпущенные", т.е. у них время последнего "дуинга"
       прошло, и он выполнен - это значит на клиента "забили",
       "отпустили" его. Вот если у "дуинга" время прошло и он
       "невыполнен" - тогда все верно, клиент "Просроченный".
*** DONE issue72 Несколько email-ов в настройках компании
    - Note taken on [2014-02-13 Чт 00:09] \\
      Забыл включить счетчик, потратил полчаса
*** DONE issue67
    CLOCK: [2014-03-17 Пн 21:54]--[2014-03-17 Пн 22:11] =>  0:17
    CLOCK: [2014-03-17 Пн 21:23]--[2014-03-17 Пн 21:48] =>  0:25
    CLOCK: [2014-03-17 Пн 20:52]--[2014-03-17 Пн 21:18] =>  0:26
    CLOCK: [2014-03-07 Пт 21:52]--[2014-03-07 Пт 22:36] =>  0:44
    CLOCK: [2014-03-07 Пт 21:32]--[2014-03-07 Пт 21:38] =>  0:06
    CLOCK: [2014-03-07 Пт 20:33]--[2014-03-07 Пт 20:58] =>  0:25
    CLOCK: [2014-03-07 Пт 19:24]--[2014-03-07 Пт 20:15] =>  0:51
    - Note taken on [2014-03-06 Чт 21:59] \\
      не совсем:

      судя по отчету:
      http://sales.saret-auto.ru/report/leads?start_date=16.02.2014

      в графе клики - показываются суммарное количество
      просмотров страниц. а надо уников.  т.е. сколько человек
      пришли с этой рекламы.
*** DONE issue74 Данные в отчете
**** DONE Отчет переименовать в "Заявки с сайта"
     CLOCK: [2014-03-19 Ср 20:28]--[2014-03-19 Ср 20:36] =>  0:08
**** DONE Поправить алгоритм суммирования данных за неделю и месяц
     CLOCK: [2014-03-19 Ср 22:53]--[2014-03-20 Чт 00:27] =>  1:34
     CLOCK: [2014-03-19 Ср 21:26]--[2014-03-19 Ср 22:01] =>  0:35
     CLOCK: [2014-03-19 Ср 20:43]--[2014-03-19 Ср 21:21] =>  0:38
     - Note taken on [2014-03-19 Ср 20:40] \\
       Верно показываются данные за сегодня\вчера. Данные за
       неделя\месяц и т.д. - явно неверные. Проверить алгоритм,
       по которому они суммируются
**** DONE Поправить алгоритм расчета CPC и LPC
     CLOCK: [2014-03-30 Вс 00:53]--[2014-03-30 Вс 01:21] =>  0:28
     CLOCK: [2014-03-29 Сб 20:32]--[2014-03-29 Сб 22:17] =>  1:45
     CLOCK: [2014-03-29 Сб 19:50]--[2014-03-29 Сб 20:22] =>  0:32
     CLOCK: [2014-03-29 Сб 18:25]--[2014-03-29 Сб 19:03] =>  0:38
     CLOCK: [2014-03-29 Сб 17:13]--[2014-03-29 Сб 18:18] =>  1:05
     CLOCK: [2014-03-29 Сб 16:32]--[2014-03-29 Сб 17:01] =>  0:29
     CLOCK: [2014-03-20 Чт 23:21]--[2014-03-20 Чт 23:45] =>  0:24
     - Note taken on [2014-03-19 Ср 20:41] \\
       Столбец CPC и CPL считать надо учитывая период за
       который показывается отчет. Т.е. сейчас если Реклама
       размещалась месяц и стоила 30 т.р., а мы смотрим отчет
       за сегодня и у нас 100 кликов, и 1 заявка, то получаем
       что CPC=30000/100=300 руб и CPL=30000/1=30000 это
       некорректно.

       правильно будет взять все клики\заявки за всю эту
       рекламную кампанию. Т.е. если у нас всего по этой
       рекламе пришло 10000 кликов и 20 заявок, то

       CPC = 30000/10000 = 3 руб. и CPL=30000/20 = 1500 руб.
**** DONE Убрать нулевые строки из отчета
     CLOCK: [2014-03-23 Вс 20:58]--[2014-03-23 Вс 21:20] =>  0:22
     CLOCK: [2014-03-23 Вс 17:50]--[2014-03-23 Вс 17:53] =>  0:03
     - Note taken on [2014-03-19 Ср 20:42] \\
       Показывать в отчете только строки в которых есть
       ненулевые значения, т.е. если в строке все нули - то ее
       не показываем.
*** DONE issue75 Падает отчет Траффик на SsangYong
    CLOCK: [2014-03-26 Ср 00:14]--[2014-03-26 Ср 00:59] =>  0:45
*** DONE issue76 Отчет "Тест-драйвы"
    Сделать отчет по тест-драйвам. Данные брать из
    таблицы "Traffics" (т.к. ее заполняет ресепшн, а они
    более ответственны чем манагеры).
**** DONE Таблица манагеры/классы
     CLOCK: [2014-04-05 Сб 15:18]--[2014-04-05 Сб 15:47] =>  0:29
     CLOCK: [2014-04-05 Сб 11:58]--[2014-04-05 Сб 12:28] =>  0:30
     CLOCK: [2014-04-05 Сб 10:54]--[2014-04-05 Сб 11:51] =>  0:57
     CLOCK: [2014-04-05 Сб 10:17]--[2014-04-05 Сб 10:47] =>  0:30
     CLOCK: [2014-04-04 Пт 22:43]--[2014-04-04 Пт 23:34] =>  0:51
     CLOCK: [2014-04-04 Пт 22:10]--[2014-04-04 Пт 22:36] =>  0:26
     CLOCK: [2014-04-04 Пт 21:19]--[2014-04-04 Пт 22:03] =>  0:44
     - Note taken on [2014-04-04 Пт 21:12] \\
       В строках менеджеры, в столбцах классы авто, все
       заканчиваются суммарными значениями (см.аттач).
**** DONE стандартный селектор дат
**** DONE Подробная таблица с тестдрайвами
     CLOCK: [2014-04-05 Сб 17:43]--[2014-04-05 Сб 18:18] =>  0:35
     CLOCK: [2014-04-05 Сб 16:19]--[2014-04-05 Сб 17:37] =>  1:18
     - Note taken on [2014-04-05 Сб 15:52] \\
       Под таблицей с манагерами\классами сделать еще одну
       таблицу, по аналогии с "расшифровкой траффика в отчете
       траффик".  столбцы: дата\время, фио\телефон, менеджер,
       класс, комментарий.
**** DONE Филтровать по менеджеру
     CLOCK: [2014-04-06 Вс 16:47]--[2014-04-06 Вс 16:52] =>  0:05
     CLOCK: [2014-04-06 Вс 16:04]--[2014-04-06 Вс 16:39] =>  0:35
     CLOCK: [2014-04-06 Вс 10:33]--[2014-04-06 Вс 11:00] =>  0:27
     - Note taken on [2014-04-05 Сб 15:53] \\
       По клику (в верхней таблице) на менеджера:
       отфильтровываем нижнюю таблицу по этому менеджеру.
**** DONE Фильтровать по классу
     - Note taken on [2014-04-05 Сб 15:54] \\
       По клику по "Классу" (заголовок столбца верхней таблицы)
       отфильтровываем нижнюю по этому классу
**** DONE Фильтровать по ячейке
     CLOCK: [2014-04-06 Вс 16:52]--[2014-04-06 Вс 17:24] =>  0:32
     - Note taken on [2014-04-05 Сб 15:54] \\
       По клику по ячейке верхней таблицы - отфильтровываем
       нижнюю по менеджеру И классу
*** DONE issue77 Добавить форму Doing-а в форму создания "Нового клиента"
    CLOCK: [2014-04-07 Пн 22:53]--[2014-04-08 Вт 00:31] =>  1:38
    CLOCK: [2014-04-07 Пн 20:15]--[2014-04-07 Пн 22:25] =>  2:10
    CLOCK: [2014-04-06 Вс 18:11]--[2014-04-06 Вс 18:25] =>  0:14
    CLOCK: [2014-04-06 Вс 17:36]--[2014-04-06 Вс 17:58] =>  0:22
    Суть проблемы: манагеры создают нового клиента
    (http://sales.saret-auto.ru/clients/new), а потом
    начинают тупить, потому-что чтобы привязать к этому
    клиенту какое-то действие, его надо найти.

    Что нужно:

    После сохранения формы "Новый клиент" вызвать и
    показать форму "Новый дуинг" с выбранным уже
    значением селектора "Лид".

    P.S. Во всех формах дуингов - заменить слово "Лид"
    на "Клиент".

** honda
*** DONE issue4 Изменить дату в импорте
    CLOCK: [2014-02-13 Чт 21:31]--[2014-02-13 Чт 22:01] =>  0:30
